[
    {
      "id": 1,
      "image": "https://i.ibb.co/VN9HHbj/javascript.png",
     "title": "Javascript",
     "instractor": "Mahmud Hasan",
     "category": "Web Development",
      "rating": 95 ,
      "details": "JavaScript is a versatile programming language primarily used for creating dynamic and interactive content on websites. It enables both client-side and server-side development, making it essential for modern web applications."

    },
    {
        "id": 2,
        "image": "https://i.ibb.co/cTrgVRm/react.png",
       "title": "React Js",
       "instractor": "Mahmud Hasan",
       "category": "libary",
        "rating": 94 ,
        "details": "React.js is a popular JavaScript library for building user interfaces, particularly single-page applications, with a component-based architecture. It allows developers to create reusable UI components and manage state efficiently, resulting in highly interactive and performant web applications."
  
      },
      {
        "id": 3,
        "image": "https://i.ibb.co/v4VmHdP/node.png",
       "title": "Node js",
       "instractor": "Mahmud Hasan",
       "category": "libary",
        "rating": 90,
        "details": "Node.js is a JavaScript runtime built on Chrome's V8 engine that enables server-side scripting and the creation of scalable network applications. It allows developers to use JavaScript for both client-side and server-side code, offering a non-blocking, event-driven architecture that is ideal for handling large volumes of I/O operations efficiently."
  
      },
      {
        "id": 4,
        "image":"https://i.ibb.co/t8gQysS/mongodb.jpg",
       "title": "MongoDB",
       "instractor": "Mahmud Hasan",
       "category": "database",
        "rating": 85 ,
        "details" :"MongoDB is a NoSQL database that stores data in flexible, JSON-like documents, allowing for a dynamic schema and making it easy to work with unstructured or semi-structured data. It is known for its scalability, high performance, and ease of use, especially in applications requiring large volumes of data and rapid development"
  
      },
      {
        "id": 5,
        "image": "https://i.ibb.co/HG1vrQJ/ielts.png",
       "title": "IELTS  for Beginners",
       "instractor": "John Doe",
       "category": "Language Test",
       "details": "IELTS is an international standardized test of English language proficiency for non-native English language speakers. It is used for immigration, university admissions, and employment purposes."
     
  
     
      },
      {
        "id": 6,
        "image": "https://i.ibb.co/1LqfcWT/web-design.jpg",
       "title": "Web Design",
       "instractor": "John Doe",
       "category": "Web Design",
    "details": "Learn the fundamentals of web design, including layout, color theory, and typography."
       
  
      },
      {
        "id": 7,
        "image":"https://i.ibb.co/z2HPj1z/spoking.jpg",
       "title": "Spoken  for Beginners",
       "instractor": "John Doe",
         "category": "Language Learning",
  "details": "Spoken English courses focus on improving conversational English skills, including pronunciation, vocabulary, and fluency, to help learners communicate effectively in English-speaking environments."
  
      },
      {
        "id": 8,
        "image": "https://i.ibb.co/tBpG9sV/python.jpg",
       "title": "Python",
       "instractor": "John Doe",
       "category": "Programming Language",
  "details": "Python is a high-level, interpreted programming language known for its readability and versatility. It is widely used in web development, data analysis, artificial intelligence, "
  
      }
 
  ]
  